## 데이터 입출력

In [2]:
import numpy as np 
import pandas as pd

In [3]:
%%writefile samples/sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing samples/sample1.csv

### CSV 파일 입력

In [5]:
df = pd.read_csv('samples/sample1.csv')   # , sep=','가 생략되어 있음 
df

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [8]:
%%writefile samples/sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting samples/sample2.csv

In [9]:
df = pd.read_csv('samples/sample2.csv')  
df

   1   1.11     one
0  2   2.22     two
1  3   3.33   three

In [10]:
df = pd.read_csv('samples/sample2.csv', names=['c1', 'c2', 'c3'])  
df

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [11]:
df = pd.read_csv('samples/sample1.csv', index_col='c1')  
df

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [15]:
%%writefile samples/sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing samples/sample3.txt

In [17]:
df = pd.read_csv('samples/sample3.txt', sep='\s+' ) 
df

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [18]:
%%writefile samples/sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing samples/sample4.txt

In [21]:
df = pd.read_csv('samples/sample4.txt', skiprows=[0,1])
df

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [22]:
%%writefile samples/sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Writing samples/sample5.csv

In [29]:
df = pd.read_csv('samples/sample5.csv', na_values=['누락', ' '])
df

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [24]:
df = pd.read_csv('samples/sample5.csv', na_values=['누락'])
df

    c1     c2      c3
0  1.0   1.11     one
1  2.0            two
2  NaN   3.33   three

### CSV 파일 출력

In [31]:
df.to_csv('samples/sample6.csv', index=False)

In [32]:
df2 = pd.read_csv('samples/sample6.csv')
df2

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [33]:
df.to_csv('samples/sample7.txt', index=False, sep='|')

In [34]:
df.to_csv('samples/sample8.tsv', index=False, sep='\t')

In [35]:
df.to_csv('samples/sample9.csv', index=False, na_rep='누락')

### 인터넷 상의 csv 파일 입력

In [37]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S